{"query": "How did the geopolitical landscape of Europe change after World War II?", "unit_tests": ["Does the response mention the division of Germany?", "Does the response mention the shift in power with the US and Soviet Union?", "Does the response describe the Marshall Plan's role in rebuilding Western Europe?"], "knowledge": "After World War II, Europe's power structure dramatically changed. Germany was divided into East and West. The Soviet Union expanded its influence over Eastern Europe while traditional empires declined. The United States emerged as a Western superpower. The United Nations was established in 1945 as an international peacekeeping organization. The Marshall Plan provided American economic aid to help rebuild Western European economies."}
{"query": "Can quantum entanglement be used for faster-than-light communication?", "unit_tests": ["Does the response discuss the limitations of quantum entanglement for faster-than-light communication?", "Does the response describe what quantum entanglement is?", "Does the response mention Einstein's description of quantum effects?"], "knowledge": "Quantum entanglement creates a connection between particles regardless of distance. While measurements of entangled particles show correlated results instantaneously, this phenomenon cannot be used to transmit information faster than light. The no-communication theorem in quantum mechanics proves this limitation, despite the 'spooky action at a distance' that Einstein described."}
{"query": "What role did women play in the industrialization of 19th-century Britain?", "unit_tests": ["Does the response mention women's role in textile industries?", "Does the response highlight the working conditions faced by women?", "Does the response mention the wage disparity between men and women workers?"], "knowledge": "Women formed a crucial part of Britain's industrial workforce during the 19th century, particularly in textile factories. Factory owners preferred hiring women because they could pay them lower wages than men. Women typically worked long hours in dangerous, unhealthy conditions with poor ventilation and hazardous machinery. Their wages were substantially lower than men's for similar work."}
{"query": "Explain the process of photosynthesis in detail.", "unit_tests": ["Does the response describe the conversion of sunlight into energy?", "Does the response mention the role of chloroplasts?", "Does the response include the chemical equation for photosynthesis?"], "knowledge": "Photosynthesis is the process where plants convert sunlight into chemical energy. This occurs primarily in chloroplasts, specialized plant cell organelles containing chlorophyll. Plants use sunlight to transform carbon dioxide and water into glucose and oxygen. The overall equation is: 6CO2 + 6H2O + light energy → C6H12O6 + 6O2."}
{"query": "What are the ethical implications of artificial intelligence in healthcare?", "unit_tests": ["Does the response discuss privacy concerns related to AI in healthcare?", "Does the response cover the issue of bias in AI decision-making?", "Does the response address concerns about reduced human oversight?"], "knowledge": "AI can revolutionize healthcare through improved diagnostics and patient care. However, it raises ethical concerns including: data privacy issues with sensitive patient information; algorithmic bias that may affect healthcare decisions differently across demographic groups; and reduced human oversight as AI systems take on more decision-making, potentially affecting the doctor-patient relationship."}